---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConnectorDiameter
source: html/f862499e-3930-c85c-a86d-89e4d1732f6a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConnectorDiameter Property

"Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId ConnectorDiameter { get; }
```